{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"layers": [{"config": {"batch_input_shape": [null, 10], "embeddings_regularizer": null, "activity_regularizer": null, "output_dim": 9, "trainable": true, "embeddings_constraint": null, "input_length": 10, "mask_zero": false, "input_dim": 27891, "dtype": "float32", "name": "embedding_2", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"noise_shape": null, "rate": 0.1, "trainable": true, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv1d_2", "activity_regularizer": null, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "filters": 128, "trainable": true, "kernel_size": [4], "activation": "relu", "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "global_max_pooling1d_2"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "units": 9}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}], "name": "sequential_3"}, "class_name": "Sequential"}, "training_config": {"metrics": ["categorical_accuracy"], "loss": "binary_crossentropy", "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"config": {"decay": 0.0, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "amsgrad": false, "epsilon": 1e-07, "beta_2": 0.9990000128746033}, "class_name": "Adam"}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1d_2/kernel", "shape": [4, 9, 128], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 9], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [9], "dtype": "float32"}, {"name": "embedding_2/embeddings", "shape": [27891, 9], "dtype": "float32"}]}]}